# lower(), upper(), capitalize() არის მეთოდები, რომლებიც გამოიყენება სტრინგებზე.
# მეთოდი არის ფუნქცია, რომელიც ეკუთვნის კონკრეტულ ობიექტს (მაგალითად, სტრინგს).
# dot ნოტაცია ნიშნავს, რომ ობიექტის სახელს წერტილით ვუწერთ მეთოდის სახელს.
# ჩვეულებრივი ფუნქცია იწერება ცალკე და იღებს არგუმენტს, ხოლო მეთოდი ობიექტზე მოქმედებს.

text = "Hello World"

# lower() - აბრუნებს სტრინგს პატარა ასოებით
print(text.lower())  

# upper() - აბრუნებს სტრინგს დიდი ასოებით
print(text.upper())  

# capitalize() - აბრუნებს სტრინგს ისე, რომ პირველი ასო იქნება დიდი, დანარჩენი პატარა
print(text.capitalize()) 

# find() მეთოდი ეძებს ქვესტრინგს სტრინგში და აბრუნებს მის პირველ ინდექსს, თუ ვერ იპოვა აბრუნებს -1-ს

# 1. შემთხვევა: ქვესტრინგი არსებობს და აბრუნებს ინდექსს
print(text.find("World"))  # შედეგი: 6

# 2. შემთხვევა: ქვესტრინგი არ არსებობს და აბრუნებს -1-ს
print(text.find("Python"))  # შედეგი: -1



print(text.find(5))  # შეცდომა: must be str, not int
